# Brew Requirements
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"
brew "mas"

# Productivity
brew "restic"
cask "docker"
cask "google-chrome"
cask "keybase"
cask "sonos"
cask "zoomus"
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Affinity Publisher", id: 881418622
mas "Xcode", id: 497799835
mas "Magnet", id: 441258766
mas "Slack", id: 803453959
mas "Notability", id: 360593530
mas "Amphetamine", id: 937984704
mas "istat-menus", id: 1319778037
mas "1Password 7", id: 1333542190
mas "Adblock Plus", id: 1432731683

# HashiCorp
tap "hashicorp/tap"
brew "hashicorp/tap/consul"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/nomad"
brew "hashicorp/tap/vault"
brew "hashicorp/tap/waypoint"
brew "hashicorp/tap/boundary"
brew "tfenv"
tap "starkandwayne/cf"
brew "starkandwayne/cf/safe"

# Programming
tap "cue-lang/tap"
brew "golang"
brew "golangci-lint"
brew "grep"
cask "iterm2"
brew "node"
brew "wget"
brew "openssh"
brew "htop"
brew "neovim"
brew "ncdu"
brew "tree"
brew "pyenv"
brew "virtualenv"
brew "watch"
brew "wget"
brew "git"
brew "git-lfs"
brew "gh"
brew "jq"
cask "homebrew/cask-fonts/font-meslo-for-powerline"

# Kubernetes
tap "fluxcd/tap"
brew "kubectl"
brew "kubectx"
brew "kind"
brew "k3d"
brew "minikube"
brew "k9s"
brew "helm"
cask "lens"
